КанцОптТорг/src/BusinessProcesses/ТестированиеКандидата/ТестированиеКандидата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ТестированиеКандидата</name>
  <task>Task.ЗадачаТестированиеКандидата</task>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Возраст</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПройденТестАдминистрирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПройденТестПрограммирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредложеннаяВакансия</name>
    <type>
      <types>EnumRef.Вакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредложенияВакансия</name>
    <type>
      <types>EnumRef.Вакансии</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

КанцОптТорг/src/Enums/Вакансии/Вакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Вакансии</name>
  <enumValues>
    <name>Оператор1С</name>
  </enumValues>
  <enumValues>
    <name>Администратор1С</name>
  </enumValues>
  <enumValues>
    <name>Программист1С</name>
  </enumValues>
</mdclass:Enum>

КанцОптТорг/src/BusinessProcesses/ТестированиеКандидата/ObjectModule.bsl
Процедура ПройденТестАдминистрированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
Результат = ПройденТестАдминистрирование;
КонецПроцедуры

Процедура ПройденТестПрограммированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПройденТестПрограммирование;
КонецПроцедуры

Процедура ВакансияОператораПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Оператор1С;
КонецПроцедуры

Процедура ВакансияАдминистратораПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Администратор1С;
КонецПроцедуры

Процедура ВакансияПрограммистПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)  
	
	ПредложеннаяВакансия = Перечисления.Вакансии.Программист1С;

КонецПроцедуры
